#!/bin/bash

# install.sh



# Цвета
GREEN=$'\033[0;32m'      # Зеленый
RED=$'\033[0;31m'        # Красный
ORANGE=$'\033[38;5;208m' # Ораньжевый
CYAN=$'\033[0;36m'       # Голубой
RESET_COLOR=$'\033[0m'   # Сбросить цвет

# Получае путь к папке проекта
PROJECT_DIR="$( cd "$( dirname "${BASH_SOURCE[0]}" )" && pwd )"

# Именования для "модулей"
NAME_PROMPT_ZSH="zsh-prompt"
NAME_PROMPT_BASH="bash-prompt"
NAME_CONFIG_NVIM="nvim"

# Массив инструкций по активации изменений после установки
arrEndInstructions=()

# Добавить инструкцию в массив. Использование: addEndInstruction "instruction"
addEndInstruction() {
    # Локальные переменные
    local instruction="$1"	# Инструкция  
    local isDuplicate=0		# Флаг "есть такая инструкция уже в массиве или нет"
    # Перебираем содержимое массива 
    for item in "${arrEndInstructions[@]}"; do
	# Если такая инструкция уже найдена - поднимаем флаг дубликата и прерываем for 
        if [[ "$item" == "$instruction" ]]; then isDuplicate=1; break; fi
    done
    # Если инструкция не дубликат записываем ее в массив
    if [[ $isDuplicate -eq 0 ]]; then arrEndInstructions+=("$instruction"); fi
}

# Обработчик системных ошибок
handlerSystemError() {
  # Сразу записываем код ошибки 
  local exit_code=$?		
  # Вывод сообщения
  println "❌ ERR:" "$RED" >&2
  println "Команда: $BASH_COMMAND" "$ORANGE" >&2
  println "Код ошибки: $exit_code" "$ORANGE" >&2
  println "Номер строки: $LINENO" "$ORANGE" >&2
}
# Системные ошибки
trap 'handlerSystemError' ERR	# Задействуем обработчик ошибок
set -e 				# Останавливаться при ошибке
set -o pipefail 		# Считать ошибкой провал любой команды в конвейере (pipe)

# Вывести цветной текст. Использование: print "text" "$COLOR"
print() {
    # Локальные переменные
    local text="$1"	# Текст для вывода 
    local color="$2" 	# Цвет вывода 
    # Выводим текст
    printf "%s" "${color}${text}${RESET_COLOR}"
}
# Вывести цветной текст и перенести строку. Использование: println "text" "$COLOR"
println() {
    # Вызываем существующую функцию print без переноса строки
    print "$1" "$2"
    # Добавляем перенос строки
    echo ""
}

# Записать строку в конец файла. Использование: writeLineInBackFile "line" "file"
writeLineInBackFile() {
    # Локальные перменные 
    local line="$1"	# Строка
    local file="$2"	# Файл		
    # Если в файле еще нет этой строки 
    if ! grep -Fxq "$line" "$file"; then
	# Записываем строку в файл
        echo "$line" >> "$file"
	# Отладка
        #echo "	- Добавляем строку $line в $file"
    else
	# Отладка
        #echo "	- Строка $line уже записана в $file"
	print ""
    fi
}




# Проверка наличия аргументов
if [ $# -eq 0 ]; then
    println "❌ ERR: Вы не указали ни одного аргумента!" "$RED"
    echo ""
    echo "Доступные аргументы:"
    print "$NAME_PROMPT_ZSH" "$GREEN";  echo "	# Строка приглашения для zsh"
    print "$NAME_PROMPT_BASH" "$GREEN"; echo "	# Строка приглашения для bash"
    print "$NAME_CONFIG_NVIM" "$GREEN"; echo "		# Конфигурация для Neovim"
    exit 1
fi


# Вывод
echo "Устаналиваю модули ..."
echo ""

# Перебираем все аргументы
for arg in "$@"; do
    case $arg in

	# Если это строка приглашения для zsh - 
        $NAME_PROMPT_ZSH)
	    # Вывод
	    print "[$NAME_PROMPT_ZSH] ... "
            # Убеждаемся, что файл ~/.zshrc будет существовать
            touch "$HOME/.zshrc"
	    # Добавляем активацию строки приглашения в ~/.zshrc
            writeLineInBackFile "source \"$PROJECT_DIR/zshrc/prompt.zsh\"" "$HOME/.zshrc"
	    # Вывод результата
            println "✅ OK" "$GREEN"
	    # Добавление инскрукции по активации
	    addEndInstruction "Выполните команду source ~/.zshrc"
            ;;

        # Здесь в будущем можно будет добавить другие компоненты
        # zsh-aliases)
        #     echo "Устанавливаем Zsh Aliases..."
        #     # ...логика для алиасов...
        #     ;;
	
	# Если скрипт не знает такого модуля
        *)
            println "$arg ... ⚠️Неизвестный модуль!" "$ORANGE"
            exit
	    ;;
    esac
done


# Вывод отступа
echo " "


# Если есть инструкции по активации изменений после установки -
if [ ${#arrEndInstructions[@]} -gt 0 ]; then
    # Вывод
    println "🎉 Установка завершена! Чтобы применить изменения:" "$GREEN"
    # Перебираем все элементы массива и выводим
    for instruction in "${arrEndInstructions[@]}"; do print " - "; println "$instruction" "$ORANGE"; done
else
    # Вывод
    println "🎉 Установка завершена! Никаких действий не требуется." "$GREEN"
fi



















